Revit 2018 API
DockablePaneState Members
The DockablePaneState type exposes the following members.
Constructors
Name | Description
DockablePaneState()
 Creates a new DockablePaneState object.
DockablePaneState(DockablePaneState)
 Constructs a new copy of the input DockablePaneState object.
Methods
Name | Description
Dispose
Releases all resources used by the DockablePaneState
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetFloatingRectangle
 When %dockPosition% is Floating, sets the rectangle used to determine the size and position of the pane when %dockPosition% is Floating. Coordinates are relative to the upper-left-hand corner of the main Revit window.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
DockPosition
 Which part of the Revit application frame the pane should dock to.
FloatingRectangle
 When %dockPosition% is Floating, this rectangle determines the size and position of the pane. Coordinates are relative to the upper-left-hand corner of the main Revit window. Note: the returned Rectangle is a copy. In order to change the pane state, you must call SetFloatingRectangle with a modified rectangle.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
TabBehind
 Ignored unless %dockPosition% is Tabbed. The new pane will appear in a tab behind the specified existing pane ID.
See Also
DockablePaneState Class
Autodesk.Revit.UI Namespace